---
kind: method
id: M:Autodesk.Revit.DB.FabricationServiceButton.GetImage
source: html/f67cd761-830f-9822-7928-15d1e9cdad96.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.GetImage Method

Gets the image for fabrication service button.

## Syntax (C#)
```csharp
public virtual Bitmap GetImage()
```

## Returns
System.Drawing.Bitmap represents the fabrication service button image. Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no preview image.